"""
Напишите программу, которая выводит список файлов в текущей директории.
"""

import os
files = os.listdir('.')
print(files)
